Repository: gitmichaelqiu/SpaceSwitcher
Catalog: SpaceSwitcher/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: A powerful utility for macOS that gives you per-space control over your applications and Dock. Part of the macOSers productivity bundle.
zh_hans: 一款强大的 macOS 效率工具，可让您针对每个桌面空间独立控制应用程序和 Dock。macOSers 生产力套件的一部分。

source: About
zh_hans: 关于

source: About SpaceSwitcher
zh_hans: 关于 SpaceSwitcher

source: Accessibility
zh_hans: 辅助功能

source: Accessibility controls both window automation and input events.
zh_hans: 辅助功能权限同时支持窗口自动化和输入事件。

source: Acknowledgements
zh_hans: 致谢

source: Action Definitions
zh_hans: 操作定义

source: Activate the application and bring its windows to the foreground.
zh_hans: 激活该应用程序并将其窗口移至最前台。

source: Add Action
zh_hans: 添加操作

source: Add Application...
zh_hans: 添加应用…

source: Add at least one action before saving.
zh_hans: 保存前至少添加一个操作。

source: Add First Item
zh_hans: 添加项目

source: Add Large Spacer
zh_hans: 添加大间距

source: Add New Rule
zh_hans: 添加新规则

source: Add Small Spacer
zh_hans: 添加小间距

source: Add Workflow Group
zh_hans: 添加工作流组

source: All Apps
zh_hans: 所有应用

source: App Shortcut
zh_hans: 应用快捷键

source: App Shortcut...
zh_hans: 应用快捷键…

source: Apply Now
zh_hans: 立即应用

source: Automatically check for updates
zh_hans: 自动检查更新

source: Automatically download updates
zh_hans: 自动下载更新

source: Automatically switch dock
zh_hans: 自动切换 Dock

source: Automatically switch spaces
zh_hans: 自动切换桌面

source: Bring to Front
zh_hans: 移至最前

source: Cancel
zh_hans: 取消

source: Check for Updates
zh_hans: 检查更新

source: Check Now
zh_hans: 立即检查

source: Choose an application before saving.
zh_hans: 保存前请选择一个应用程序。

source: Choose from Applications...
zh_hans: 从应用程序中选择…

source: Choose Shortcut Modifiers
zh_hans: 选择修饰键

source: Choose spaces
zh_hans: 选择桌面

source: Condition
zh_hans: 条件

source: Conditions cannot be nested.
zh_hans: 条件不能嵌套。

source: Could Not Read Current Dock
zh_hans: 无法读取当前 Dock

source: Create a rule to control applications by desktop space.
zh_hans: 创建按桌面控制应用程序的规则。

source: Create First Rule
zh_hans: 创建第一个规则

source: Create Set
zh_hans: 创建组

source: Default Set
zh_hans: 默认组

source: Delete Dock Set
zh_hans: 删除 Dock 组

source: Delete Rule
zh_hans: 删除规则

source: Delete Rule?
zh_hans: 删除规则？

source: Dock Automation
zh_hans: Dock 自动化

source: Dock Set
zh_hans: Dock 组

source: Docks
zh_hans: Dock

source: Drag to rearrange
zh_hans: 拖动以重新排序

source: Each space can belong to only one workflow group.
zh_hans: 每个桌面只能属于一个工作流组。

source: Edit
zh_hans: 编辑

source: Edit Rule
zh_hans: 编辑规则

source: Enable or disable this rule.
zh_hans: 启用或停用此规则。

source: Enable Rule
zh_hans: 启用规则

source: End If
zh_hans: 结束条件

source: End If must follow an If action.
zh_hans: End If 必须跟在 If 操作之后。

source: Every application
zh_hans: 所有应用程序

source: Every If action must have an End If.
zh_hans: 每个 If 操作都必须有 End If。

source: Every If block must contain an action.
zh_hans: 每个 If 区块都必须包含一个操作。

source: Every workflow group must contain at least one action.
zh_hans: 每个工作流组至少要包含一个操作。

source: Every workflow group must target at least one space.
zh_hans: 每个工作流组至少要指定一个桌面。

source: Forcefully unhide and unminimize the application, regardless of its previous state.
zh_hans: 无论之前的状态如何，强制取消隐藏并取消最小化该应用程序。

source: Front
zh_hans: 前台

source: General
zh_hans: 通用

source: Grant
zh_hans: 授权

source: Granted
zh_hans: 已授权

source: Hide
zh_hans: 隐藏

source: Hide the application.
zh_hans: 隐藏应用程序。

source: If
zh_hans: 如果

source: If %@
zh_hans: 如果 %@

source: Input Events
zh_hans: 输入事件

source: Install DesktopRenamer
zh_hans: 安装 DesktopRenamer

source: Intelligent reversal. Only unhide and unminimize if SpaceSwitcher was the one that hid it earlier.
zh_hans: 智能反转。只有当 SpaceSwitcher 之前隐藏了该应用程序时，才会取消隐藏/取消最小化。

source: Launch at login
zh_hans: 登录时启动

source: Launch DesktopRenamer
zh_hans: 启动 DesktopRenamer

source: Let you right-click with the Option key.
zh_hans: 允许使用 Option 键进行右键点击。

source: Links
zh_hans: 链接

source: Minimize
zh_hans: 最小化

source: Minimize all windows of the application.
zh_hans: 最小化所有窗口。

source: More Apps
zh_hans: 更多应用

source: My GitHub
zh_hans: 我的 GitHub

source: My website
zh_hans: 我的网站

source: Name
zh_hans: 名称

source: New Dock Set
zh_hans: 新 Dock 组

source: No automation rules yet.
zh_hans: 尚无自动化规则。

source: No fallback actions
zh_hans: 无备用操作

source: No items assigned to this Dock set
zh_hans: 此 Dock 组未分配任何项目

source: No results
zh_hans: 无结果

source: No spaces detected
zh_hans: 未检测到桌面

source: No spaces detected.
zh_hans: 未检测到桌面。

source: Not granted
zh_hans: 未授权

source: Open DesktopRenamer
zh_hans: 打开 DesktopRenamer

source: Per-App Automation
zh_hans: App自动化

source: Permissions
zh_hans: 权限

source: Quit
zh_hans: 退出

source: Record every shortcut before saving.
zh_hans: 保存前请录制所有快捷键。

source: Record Shortcut
zh_hans: 录制快捷键

source: Recording...
zh_hans: 录制…

source: Remove Action
zh_hans: 移除操作

source: Remove Condition Block
zh_hans: 移除条件区块

source: Remove Dock Item
zh_hans: 移除 Dock 项目

source: Remove Group
zh_hans: 移除组

source: Remove Workflow Group
zh_hans: 移除工作流组

source: Remove Workflow Group?
zh_hans: 移除工作流组？

source: Replace with Current Dock Items
zh_hans: 替换为当前 Dock 项目

source: Report an issue
zh_hans: 报告问题

source: Requires %@.
zh_hans: 需要 %@。

source: Reset to default
zh_hans: 重置

source: Restore
zh_hans: 恢复

source: Restore Previous App
zh_hans: 恢复之前的应用

source: Rule Automation
zh_hans: 规则自动化

source: Rules
zh_hans: 规则

source: Running Applications
zh_hans: 正在运行的应用程序

source: Save Rule
zh_hans: 保存规则

source: Search
zh_hans: 搜索

source: Select a Dock Set to edit its configuration
zh_hans: 选择一个 Dock 组以编辑其配置

source: Select Application
zh_hans: 选择应用程序

source: Settings
zh_hans: 设置

source: Shortcut Options
zh_hans: 快捷键选项

source: Show
zh_hans: 显示

source: Source Space
zh_hans: 来源桌面

source: Space %lld
zh_hans: 桌面 %lld

source: Space assignments are saved but only applied when Automatically switch dock is enabled.
zh_hans: 桌面分配会被保存，但只有启用“自动切换 Dock”后才会应用。

# SpaceCount
source: %d spaces
zh_hans: %d 个桌面

source: Spaces
zh_hans: 桌面

source: SpaceSwitcher could not read the current Dock items.
zh_hans: SpaceSwitcher 无法读取当前 Dock 项目。

source: SpaceSwitcher's GitHub
zh_hans: SpaceSwitcher 的 GitHub

source: SpaceSwitcher's website
zh_hans: SpaceSwitcher 的网站

source: System Shortcut
zh_hans: 系统快捷键

source: System Shortcut...
zh_hans: 系统快捷键…

source: Target Application
zh_hans: 目标应用程序

source: The default set is used for any space that doesn't have a specific assignment.
zh_hans: 默认组用于任何没有特定分配的桌面。

source: The essential tool for naming and organizing your desktop spaces.
zh_hans: 命名和组织桌面空间的必备工具。

source: The spaces and actions in this workflow group will be removed.
zh_hans: 此工作流组中的桌面和操作将被移除。

source: This dock set is used automatically for all unassigned spaces.
zh_hans: 此 Dock 组将自动用于所有未分配的桌面。

source: This removes the rule for %@.
zh_hans: 这将移除 %@ 的规则。

source: Wait for App to Be Frontmost
zh_hans: 等待应用置于最前台

source: window is frontmost
zh_hans: 窗口位于最前端

source: window is fullscreen
zh_hans: 窗口处于全屏模式

source: window is hidden
zh_hans: 窗口已隐藏

source: window is minimized
zh_hans: 窗口已最小化

source: Workflow Group %lld
zh_hans: 工作流组 %lld
